[
  {
    "id": 1,
    "title": "Ae Watan Mere Watan",
    "description": "Set during India’s freedom movement, 'Ae Watan Mere Watan' (2025) follows Usha Mehta, a courageous young woman who defied British rule by running an underground radio station that spread the message of independence. The film captures her journey from an ordinary student to a symbol of resistance, exploring the emotional cost of patriotism and sacrifice. Through riveting performances and detailed period visuals, it celebrates the unsung heroes who fueled India’s fight for freedom. More than a patriotic biopic, it’s a reminder that even one voice can ignite revolution and inspire generations to value the freedom we often take for granted.",
    "cover_picture": "https://i.ibb.co.com/1GpfcS9z/Ae-Watan-Mere-Watan-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/SDqSTmW3/Ae-Watan-Mere-Watan.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.6,
    "audio": ["Hindi"],
    "subtitle": ["English", "Bengali"],
    "video_quality": "4k",
    "genres": ["Drama", "Historical", "Biography"],
    "movie_category": "Hindi",
    "category": "Bollywood"
  },
  {
    "id": 2,
    "title": "Singham Again",
    "description": "Rohit Shetty’s 2025 blockbuster 'Singham Again' continues the high-octane police universe. Ajay Devgn reprises his role as the fearless cop Bajirao Singham, who joins forces with officers Simmba and Sooryavanshi to dismantle a nationwide terror syndicate. The movie delivers massive action, emotional intensity, and patriotic fervor while deepening the theme of justice versus power. Packed with breathtaking stunts, explosions, and cameos, it unites the biggest stars of Bollywood in one cinematic spectacle. At its core, the film explores how integrity and courage still matter in a world where corruption often wins.",
    "cover_picture": "https://i.ibb.co.com/bgYfR8KG/Singham-Again-Cover.webp",
    "card_picture": "https://i.ibb.co.com/pBcnqJbT/Singham-Again.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.0,
    "audio": ["Hindi"],
    "subtitle": ["English"],
    "video_quality": "8k",
    "genres": ["Action", "Crime", "Thriller"],
    "movie_category": "Hindi",
    "category": "Bollywood"
  },
  {
    "id": 3,
    "title": "Chhaava",
    "description": "'Chhaava' (2025) is a historical war epic based on the life of Chhatrapati Sambhaji Maharaj, the brave son of Shivaji. The film chronicles his battles, ideals, and tragic demise, blending political intrigue, valor, and human emotion. Vicky Kaushal delivers a fierce yet vulnerable performance, depicting a leader torn between duty and compassion. The grandeur of the Maratha empire and the brutal realities of war are brought to life through stunning visuals and an evocative soundtrack. More than a tale of conflict, it’s a timeless story of courage, loyalty, and legacy.",
    "cover_picture": "https://i.ibb.co.com/v6bQgnBx/Chhaava-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/LdXG1kRN/Chhaava.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.8,
    "audio": ["Hindi"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Action", "Drama", "Historical"],
    "movie_category": "Hindi",
    "category": "Bollywood"
  },
  {
    "id": 4,
    "title": "Bhool Bhulaiyaa 3",
    "description": "Kartik Aaryan returns in 'Bhool Bhulaiyaa 3' (2025), a thrilling horror-comedy that continues the eerie legacy of Manjulika. Blending supernatural mystery with humor and music, the film takes audiences into a haunted palace where secrets of the past resurface with terrifying consequences. The story revolves around a young man’s quest to uncover a ghost’s curse that’s rooted in revenge and heartbreak. It’s spooky yet entertaining, offering a perfect mix of laughter, tension, and folklore-inspired scares, cementing its place as a modern horror classic.",
    "cover_picture": "https://i.ibb.co.com/67GtYS91/Bhool-Bhulaiyaa-3-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/rKCSyN1D/Bhool-Bhulaiyaa-3.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.2,
    "audio": ["Hindi"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Comedy", "Horror", "Mystery"],
    "movie_category": "Hindi",
    "category": "Bollywood"
  },
  {
    "id": 5,
    "title": "Sky Force",
    "description": "Based on true events, 'Sky Force' (2025) depicts India’s first and most daring airstrike mission. Akshay Kumar plays a courageous Air Force officer who leads an impossible operation under extreme pressure. With high-end aerial combat sequences and emotional depth, the movie honors the bravery and sacrifice of India’s pilots. Beyond the action, it’s a patriotic drama about teamwork, faith, and determination in the face of danger. 'Sky Force' highlights the unsung heroes who defend skies while carrying the weight of an entire nation’s pride.",
    "cover_picture": "https://i.ibb.co.com/C531ZbtM/Sky-Force-Cover.webp",
    "card_picture": "https://i.ibb.co.com/vCJSjBPt/Sky-Force.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.3,
    "audio": ["Hindi"],
    "subtitle": ["English", "Bengali"],
    "video_quality": "8k",
    "genres": ["Action", "War", "Drama"],
    "movie_category": "Hindi",
    "category": "Bollywood"
  },
  {
    "id": 6,
    "title": "Antarjal",
    "description": "'Antarjal' (2025) is Bangladesh’s first true cyber-thriller, exploring the dark world of hacking, national security, and digital espionage. When a cyber-attack threatens the country’s infrastructure, a group of young tech experts must race against time to save millions of lives. The movie combines suspense, patriotism, and the emotional human element behind technology. It sheds light on the power and responsibility that come with controlling information in the digital era. With top-notch VFX and gripping performances, 'Antarjal' redefines modern Bengali cinema.",
    "cover_picture": "https://i.ibb.co.com/ycC5bMHG/Antarjal-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/DgrQ6B4y/Antarjal.webp",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.5,
    "audio": ["Bengali"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Thriller", "Action", "Drama"],
    "movie_category": "Bengali",
    "category": "Tollywood"
  },
  {
    "id": 7,
    "title": "Priyotoma",
    "description": "Following the record-breaking success of 'Priyotoma', the sequel (2025) continues the intense romantic saga between Shakib Khan’s character and his lost love. The movie dives deeper into the themes of redemption, loyalty, and emotional rebirth. With a mix of heart-touching music and cinematic grandeur, 'Priyotoma 2' balances drama, romance, and tragedy. It showcases the power of love that survives betrayal and distance. The film cements Shakib Khan’s stardom in South Asian cinema with its visual storytelling and moving narrative.",
    "cover_picture": "https://i.ibb.co.com/LXN77M46/Priyotoma-2-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/h1xCY3Cb/Priyotoma-2.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.9,
    "audio": ["Bengali"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Romance", "Drama"],
    "movie_category": "Bengali",
    "category": "Tollywood"
  },
  {
    "id": 8,
    "title": "Surongo",
    "description": "The sequel to Afran Nisho’s breakout hit, 'Surongo 2' (2025) delves into greed, morality, and survival. After escaping imprisonment, Masud faces a darker underworld where trust is an illusion. Combining sharp storytelling with gritty visuals, the film reflects on the cost of choices and the relentless pull of fate. With psychological depth and fast-paced direction, it raises the bar for Bangladeshi thrillers, merging suspense with emotional realism.",
    "cover_picture": "https://i.ibb.co.com/xtPzLVCH/Surongo-2-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/LDPR27DL/Surongo-2.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.1,
    "audio": ["Bengali"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Thriller", "Crime", "Drama"],
    "movie_category": "Bengali",
    "category": "Tollywood"
  },
  {
    "id": 9,
    "title": "Leader: Amie Bangladesh",
    "description": "This 2025 Bangladeshi political drama centers on a young visionary who rises from the grassroots to challenge corruption and power abuse. Mixing romance, social awakening, and national pride, it tells the story of modern-day leadership in a changing society. The film combines emotion with a bold message about responsibility and sacrifice for one’s country. Through compelling storytelling, it paints a vivid portrait of courage and conviction.",
    "cover_picture": "https://i.ibb.co.com/8H1dF0H/Amie-Bangladesh-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/0jG3DHfJ/Amie-Bangladesh.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.7,
    "audio": ["Bengali"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Drama", "Political", "Romance"],
    "movie_category": "Bengali",
    "category": "Tollywood"
  },
  {
    "id": 10,
    "title": "Deyaler Desh",
    "description": "'Deyaler Desh' (2025) portrays the human cost of separation during the Partition era. Through interwoven stories of two families torn apart by borders, the film captures loss, resilience, and identity. With stunning cinematography and poignant performances, it’s both a period piece and a timeless exploration of belonging. It reflects the pain of millions and the hope that bridges built by love can heal history’s deepest scars.",
    "cover_picture": "https://i.ibb.co.com/5gjg7Vyj/Deyaler-Desh-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/8LRn03fn/Deyaler-Desh.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.0,
    "audio": ["Bengali"],
    "subtitle": ["English"],
    "video_quality": "1080p",
    "genres": ["Drama", "Historical"],
    "movie_category": "Bengali",
    "category": "Tollywood"
  },
  {
    "id": 11,
    "title": "Aadujeevitham (The Goat Life)",
    "description": "'Aadujeevitham' (The Goat Life) is a Malayalam survival drama based on Benyamin’s acclaimed novel. It tells the true story of Najeeb, a Malayali laborer trapped in the deserts of Saudi Arabia and forced into a life of servitude tending goats. The 2025 film captures his years of isolation, despair, and spiritual awakening as he clings to hope and faith. Directed by Blessy and starring Prithviraj Sukumaran, it’s a visually stunning and emotionally devastating journey of human endurance. The film’s realism and cinematography make it one of Mollywood’s most ambitious works ever.",
    "cover_picture": "https://i.ibb.co.com/YFzvMVYy/Aadujeevitham-The-Goat-Life-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/d0YchMNx/Aadujeevitham-The-Goat-Life.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.6,
    "audio": ["Malayalam", "English"],
    "subtitle": ["English", "Bengali"],
    "video_quality": "8k",
    "genres": ["Drama", "Survival", "Biography"],
    "movie_category": "Malayalam",
    "category": "Mollywood"
  },
  {
    "id": 12,
    "title": "Vaazhai",
    "description": "Directed by Mari Selvaraj, 'Vaazhai' (2025) explores life, legacy, and the struggles of marginalized communities in rural South India. The film portrays generational trauma, resilience, and the beauty of human connection against systemic oppression. With poetic visuals and deeply human storytelling, it reflects the cultural richness and emotional complexity of Malayalam-Tamil border regions. The performances are subtle yet haunting, and the narrative unfolds like a folk song — melancholic, hopeful, and profoundly real.",
    "cover_picture": "https://i.ibb.co.com/9kNyK0vb/Vaazhai-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/wrw97dvj/Vaazhai.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.0,
    "audio": ["Malayalam", "Tamil"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Drama", "Social", "Family"],
    "movie_category": "Malayalam",
    "category": "Mollywood"
  },
  {
    "id": 13,
    "title": "Ajayante Randam Moshanam",
    "description": "'Ajayante Randam Moshanam' (2025) is a fantasy-adventure saga spanning three generations of heroism. Tovino Thomas plays multiple characters, each linked by destiny as they fight for justice in different eras. Combining folklore, mythology, and stunning action, it’s a rare Malayalam epic with visual effects on par with international cinema. The movie blends family values with adventure, exploring how courage and sacrifice echo through time. Its layered narrative, powerful performances, and mystical score make it a landmark in regional cinema.",
    "cover_picture": "https://i.ibb.co.com/jkfKXn5T/Ajayante-Randam-Moshanam-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/fVjWK7H6/Ajayante-Randam-Moshanam.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.3,
    "audio": ["Malayalam"],
    "subtitle": ["English", "Hindi"],
    "video_quality": "8k",
    "genres": ["Adventure", "Fantasy", "Action"],
    "movie_category": "Malayalam",
    "category": "Mollywood"
  },
  {
    "id": 14,
    "title": "Abraham Ozler",
    "description": "'Abraham Ozler' (2025) is a gripping psychological thriller starring Jayaram as a police officer haunted by his past. When a series of murders begin mirroring his unsolved case from years ago, he is forced into a mind-bending confrontation with trauma, guilt, and truth. The film blends investigation with emotional depth, offering a rare portrayal of grief within a crime narrative. Tight editing and atmospheric music keep the tension high, while the central performance anchors the human story beneath the mystery.",
    "cover_picture": "https://i.ibb.co.com/99WwFtPy/Abraham-Ozler-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/MYnNgPy/Abraham-Ozler.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.9,
    "audio": ["Malayalam"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Thriller", "Crime", "Drama"],
    "movie_category": "Malayalam",
    "category": "Mollywood"
  },
  {
    "id": 15,
    "title": "Turbo",
    "description": "Starring Mammootty, 'Turbo' (2025) is a high-voltage action-comedy about an aging gangster forced back into the underworld after his peaceful retirement is shattered. Blending humor with stylish violence, it explores redemption, loyalty, and fatherhood. With a charismatic lead performance and sharp direction, the movie revives the old-school charm of mass Malayalam cinema while addressing modern moral dilemmas. 'Turbo' combines emotional storytelling with crowd-pleasing entertainment, showcasing Mammootty’s timeless screen presence.",
    "cover_picture": "https://i.ibb.co.com/GQMw6MfT/Turbo-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/TMnr5TFn/Turbo.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 7.8,
    "audio": ["Malayalam"],
    "subtitle": ["English"],
    "video_quality": "4k",
    "genres": ["Action", "Comedy", "Drama"],
    "movie_category": "Malayalam",
    "category": "Mollywood"
  },
  {
    "id": 16,
    "title": "Dune: Part Two",
    "description": "Denis Villeneuve’s 'Dune: Part Two' (2025) continues the epic adaptation of Frank Herbert’s masterpiece. Paul Atreides unites with the Fremen to avenge his family and reclaim Arrakis. With breathtaking cinematography, masterful world-building, and profound political themes, it explores destiny, faith, and rebellion. The film’s scale and emotional power make it a defining sci-fi epic of the decade. Beyond spectacle, it questions the price of prophecy and the human cost of empire.",
    "cover_picture": "https://i.ibb.co.com/pBRGpbnT/Dune-Part-Two-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/FLRHtFRt/Dune-Part-Two.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 9.0,
    "audio": ["English"],
    "subtitle": ["English", "Bengali"],
    "video_quality": "8k",
    "genres": ["Science fiction", "Adventure", "Drama"],
    "movie_category": "English",
    "category": "Hollywood"
  },
  {
    "id": 17,
    "title": "Deadpool & Wolverine",
    "description": "'Deadpool & Wolverine' (2025) brings together two of Marvel’s most iconic antiheroes in a chaotic, hilarious, and action-packed adventure. When timelines collide, Deadpool and Wolverine must reluctantly team up to save their worlds from annihilation. The film balances outrageous comedy with genuine emotion, showcasing Ryan Reynolds and Hugh Jackman’s chemistry. Beneath the irreverence lies a heartfelt story about redemption and friendship. It’s both a love letter to fans and a reinvention of the superhero genre.",
    "cover_picture": "https://i.ibb.co.com/rKSKs214/Deadpool-Wolverine-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/q3CVp2Z9/Deadpool-Wolverine.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.7,
    "audio": ["English"],
    "subtitle": ["English"],
    "video_quality": "8k",
    "genres": ["Action", "Comedy", "Science fiction"],
    "movie_category": "English",
    "category": "Hollywood"
  },
  {
    "id": 18,
    "title": "Joker: Folie à Deux",
    "description": "Todd Phillips returns with 'Joker: Folie à Deux' (2025), a dark psychological musical exploring Arthur Fleck’s descent alongside Harley Quinn, played by Lady Gaga. The film blurs reality and delusion through song, performance, and madness. Set in Gotham’s decaying heart, it examines love as both salvation and destruction. Joaquin Phoenix delivers a haunting performance, matched by Gaga’s raw emotional depth. It’s less a sequel and more an operatic exploration of identity and shared insanity.",
    "cover_picture": "https://i.ibb.co.com/LDyQKQcy/Joker-Folie-Deux-Cover.jpg",
    "card_picture": "https://i.ibb.co.com/DPdjyfMV/Joker-Folie-Deux.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.9,
    "audio": ["English"],
    "subtitle": ["English"],
    "video_quality": "8k",
    "genres": ["Drama", "Musical", "Thriller"],
    "movie_category": "English",
    "category": "Hollywood"
  },
  {
    "id": 19,
    "title": "Kingdom of the Planet of the Apes",
    "description": "Set generations after Caesar’s reign, 'Kingdom of the Planet of the Apes' (2025) follows a young ape who challenges the new oppressive order of his kind. It’s a story of legacy, evolution, and freedom, mixing thrilling visuals with emotional storytelling. The film expands the mythology of the franchise while asking deep questions about power and morality. A powerful cinematic blend of spectacle and soul, it stands as one of the best reboots in modern sci-fi history.",
    "cover_picture": "https://i.ibb.co.com/1c6Wk5r/Kingdom-of-the-Planet-of-the-Apes-Cover.webp",
    "card_picture": "https://i.ibb.co.com/LbLLjTJ/Kingdom-of-the-Planet-of-the-Apes.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.4,
    "audio": ["English"],
    "subtitle": ["English"],
    "video_quality": "8k",
    "genres": ["Action", "Science fiction", "Adventure"],
    "movie_category": "English",
    "category": "Hollywood"
  },
  {
    "id": 20,
    "title": "Inside Out 2",
    "description": "Pixar’s 'Inside Out 2' (2025) revisits Riley as a teenager navigating complex new emotions like Anxiety, Envy, and Embarrassment. The sequel expands the emotional universe with humor and wisdom, teaching audiences about mental growth and acceptance. The film balances joy and sadness with beautiful storytelling that resonates with both kids and adults. Emotionally rich, visually stunning, and profoundly human, it reinforces Pixar’s mastery of turning feelings into unforgettable cinema.",
    "cover_picture": "https://i.ibb.co.com/9mC3C9rN/Inside-Out-2-Cover.webp",
    "card_picture": "https://i.ibb.co.com/kgzRMyCG/Inside-Out-2.jpg",
    "released_date": "2025",
    "platform": "IMDb",
    "rating": 8.8,
    "audio": ["English"],
    "subtitle": ["English", "Bengali"],
    "video_quality": "4k",
    "genres": ["Animation", "Family", "Comedy"],
    "movie_category": "English",
    "category": "Hollywood"
  }
]
